#include <stdio.h>
#include "wifi.h"


/******************************************************************
函 数: void ms_delay(int t)
功 能: 毫秒级延时
参 数: 无
返回值: 无
*******************************************************************/
void ms_delay(int t)?
{ ?
int i,j;?
? for(i=t;i>0;i--) ??
for(j=110;j>0;j--);?
}


/******************************************************************
函 数: void LED(void)
功 能: 发送完命令后显示用的函数
参 数: 无
返回值: 无
*******************************************************************/
void LED(void)
{


P1 = 0;
ms_delay(100);
P1 = 0xff;
ms_delay(100);


}


/******************************************************************
函 数: void WIFI_Init(void)
功 能: wifi初始化(名字：esp8266；密码：1234567890)
参 数: 无
返回值: 无
*******************************************************************/
void WIFI_Init(void)
{


ES = 0;
TI = 1; 


printf("AT+RST\r\n");
LED();
ms_delay(1000) ;


printf("AT+CWMODE=3\r\n");
LED();
ms_delay(1000) ;


printf("AT+CIPMUX=1\r\n");
LED();?
ms_delay(1000) ;


printf("AT+CIPSERVER=1,8080\r\n");
LED();
ms_delay(1000) ;


while(!TI);
TI = 0;
ES = 1;


}
--------------------- 
作者：lnyaigsm0110 
来源：CSDN 
原文：https://blog.csdn.net/lnyaigsm0110/article/details/62042361 
版权声明：本文为博主原创文章，转载请附上博文链接！